tap "hashicorp/tap"
tap "charmbracelet/tap"

brew "asdf"
brew "stow"
brew "fzf"
brew "gh"
brew "docker-compose"
brew "docker-buildx"
brew "libpq"
brew "jwt-cli"
brew "hashicorp/tap/terraform"
brew "proxychains-ng"
brew "ffmpeg"
brew "pipx"
brew "uv"
brew "atuin"
brew "cmake"
brew "libtool"
brew "openssl@3"
brew "charmbracelet/tap/crush"
brew "ripgrep"
brew "bat"
brew "tmux"

cask "logseq"
cask "google-cloud-sdk"
cask "gcloud-cli"
cask "unnaturalscrollwheels"
cask "iterm2"
cask "font-iosevka"
cask "karabiner-elements"
cask "bitwarden"
cask "cursor-cli"
cask "vscodium"
cask "obsidian"
cask "1password-cli"
cask "claude-code"
cask "font-jetbrains-mono"
cask "markedit"
cask "codex"

