tap "hashicorp/tap"
tap "oven-sh/bun"
tap "pantsbuild/tap"

brew "asdf"
brew "stow"
brew "fzf"
brew "gh"
brew "docker-compose"
brew "docker-buildx"
brew "libpq"
brew "jwt-cli"
brew "hashicorp/tap/terraform"
brew "proxychains-ng"
brew "ffmpeg"
brew "pipx"
brew "uv"
brew "cmake"
brew "libtool"
brew "openssl@3"
brew "ripgrep"
brew "bat"
brew "tmux"
brew "openjdk"
brew "python@3.12"
brew "oven-sh/bun/bun"

cask "bitwarden"
cask "1password-cli"

cask "gcloud-cli"
cask "claude-code@latest"
cask "pantsbuild/tap/pants"

cask "orbstack"
cask "iterm2"

cask "slack"
cask "alt-tab"
cask "obsidian"
cask "puremac"

cask "font-jetbrains-mono"
cask "font-iosevka"
cask "font-bricolage-grotesque"
cask "font-ia-writer-quattro"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-sans-condensed"
