tap "hashicorp/tap"
tap "pantsbuild/tap"

brew "asdf"
brew "stow"
brew "fzf"
brew "gh"
brew "docker-compose"
brew "docker-buildx"
brew "libpq"
brew "jwt-cli"
brew "hashicorp/tap/terraform"
brew "proxychains-ng"
brew "ffmpeg"
brew "pipx"
brew "uv"
brew "atuin"
brew "cmake"
brew "libtool"
brew "openssl@3"
brew "ripgrep"
brew "bat"
brew "tmux"

cask "pantsbuild/tap/pants"
cask "orbstack"
cask "gcloud-cli"
cask "unnaturalscrollwheels"
cask "iterm2"
cask "font-iosevka-nerd-font"
cask "karabiner-elements"
cask "bitwarden"
cask "1password-cli"
cask "claude-code"
cask "font-jetbrains-mono"
cask "slack"
cask "visual-studio-code"

